; domain
(define (domain blockWorld)
    (:requirements :strips :typing)
    (:types block)
    (:predicates
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty)
        (holding ?x - block))
    (:action pick-up
        ;;; action qui ramasse un bloc pose sur la table
        :parameters (?x - block)
        :precondition (and (clear ?x) (ontable ?x) (handempty))
        :effect (and (not (ontable ?x))
                (not (clear ?x))
                (not (handempty))
                (holding ?x)))
    (:action unstack
        ;;; action qui désempiler un bloc pose sur un autre bloc
        :parameters (?x - block ?y - block)
        :precondition (and (clear ?x) (on ?x ?y) (handempty))
        :effect (and (not (on ?x ?y))
                (not (clear ?x))
                (not (handempty))
                (holding ?x)
                (clear ?y)))
    (:action putdown
        ;;; action qui ramasse un bloc pose sur la table
        :parameters (?x - block)
        :precondition (holding ?x)
        :effect (and (not (holding ?x))
                (clear ?x)
                (ontable ?x)
                (handempty)))
    (:action stack
        ;;; action qui empiler un bloc sur un autre bloc
        :parameters (?x - block ?y - block)
        :precondition (and (clear ?y) (holding ?x))
        :effect (and (on ?x ?y)
                (clear ?x)
                (handempty)
                (not(holding ?x))
                (not(clear ?y))))
                   
)

; problem
(define (problem blockProblem)
	(:domain blockWorld)
	(:objects A B C D E F - block)
	(:init 
		;;; Première pile
		(clear B) (ontable C) (on B D) (on D C) 
		;;; Deuxième pile		
		(clear F) (ontable A) (on F E) (on E A) 
		;;; Mains vides		
		(handempty))
	(:goal (and (on A B) (on B C) (on C D) (on D E) (on E F) 
		(ontable F) (clear A) (handempty)))
)

; plan
1. (unstack f e)
   deleted: (on f e) (clear f) (handempty)
   added: (holding f) (clear e)
   goals met: 0 of 8
2. (putdown f)
   deleted: (holding f)
   added: (clear f) (ontable f) (handempty)
   goals met: 2 of 8
3. (unstack e a)
   deleted: (on e a) (clear e) (handempty)
   added: (holding e) (clear a)
   goals met: 2 of 8
4. (stack e f)
   deleted: (holding e) (clear f)
   added: (on e f) (clear e) (handempty)
   goals met: 4 of 8
5. (unstack b d)
   deleted: (on b d) (clear b) (handempty)
   added: (holding b) (clear d)
   goals met: 3 of 8
6. (stack b a)
   deleted: (holding b) (clear a)
   added: (on b a) (clear b) (handempty)
   goals met: 3 of 8
7. (unstack d c)
   deleted: (on d c) (clear d) (handempty)
   added: (holding d) (clear c)
   goals met: 2 of 8
8. (stack d e)
   deleted: (holding d) (clear e)
   added: (on d e) (clear d) (handempty)
   goals met: 4 of 8
9. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 3 of 8
10. (stack c d)
   deleted: (holding c) (clear d)
   added: (on c d) (clear c) (handempty)
   goals met: 5 of 8
11. (unstack b a)
   deleted: (on b a) (clear b) (handempty)
   added: (holding b) (clear a)
   goals met: 5 of 8
12. (stack b c)
   deleted: (holding b) (clear c)
   added: (on b c) (clear b) (handempty)
   goals met: 7 of 8
13. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 5 of 8
14. (stack a b)
   deleted: (holding a) (clear b)
   added: (on a b) (clear a) (handempty)
   goals met: 8 of 8
